TodWulff/ARMbasic_Repo/_Coridium/MiClib/system_stm32f411.c

#include <stdint.h>
#include "uart_stm.h"

#if defined EMW3165
#include "stm32f4xx_rcc.h" // for external clock setup
#endif

#include "STM32F411.h"
//#include "stm32f4xx_hal_adc.h"

int sector_erased;

uint32_t SystemCoreClock = 100000000;
  __I unsigned char AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

void NVIC_SetPriority(IRQn_Type IRQn, uint32_t priority)
{
  if(IRQn < 0) {
    SCB->SHP[((uint32_t)(IRQn) & 0xF)-4] = ((priority << (8 - __NVIC_PRIO_BITS)) & 0xff); } /* set Priority for Cortex-M  System Interrupts */
  else {
    NVIC->IP[(uint32_t)(IRQn)] = ((priority << (8 - __NVIC_PRIO_BITS)) & 0xff);    }        /* set Priority for device specific Interrupts  */
}

uint32_t NVIC_EncodePriority (uint32_t PriorityGroup, uint32_t PreemptPriority, uint32_t SubPriority)
{
  uint32_t PriorityGroupTmp = (PriorityGroup & 0x07);          /* only values 0..7 are used          */
  uint32_t PreemptPriorityBits;
  uint32_t SubPriorityBits;

  PreemptPriorityBits = ((7 - PriorityGroupTmp) > __NVIC_PRIO_BITS) ? __NVIC_PRIO_BITS : 7 - PriorityGroupTmp;
  SubPriorityBits     = ((PriorityGroupTmp + __NVIC_PRIO_BITS) < 7) ? 0 : PriorityGroupTmp - 7 + __NVIC_PRIO_BITS;

  return (
           ((PreemptPriority & ((1 << (PreemptPriorityBits)) - 1)) << SubPriorityBits) |
           ((SubPriority     & ((1 << (SubPriorityBits    )) - 1)))
         );
}

// forwards
void STM_ClockConfig(RCC_ClkInitTypeDef  *RCC_ClkInitStruct, uint32_t FLatency);
void STM_OscConfig(RCC_OscInitTypeDef  *RCC_OscInitStruct);
void SystemClock_Config(void);


void SystemCoreClockUpdate(void)
{
	SystemCoreClock = 100000000;//MAR
}


  /* Determine clock frequency according to clock register values             */

//void fpu_init(void)
//{
//}

//#ifdef FOR_BASIC

#include "cor_runtime.h"
#include "basic_pcb.h"
extern int g_var_seg[] ;
extern void flt_printR(void);
extern void b_sprintfR(void);
extern char *str_aptr;
#define str_accum (int)(g_var_seg + (MAX_VAR_COUNT<<2))
#define varsize   (int)(MAX_VAR_COUNT>>2)
#define TBL_TODO 0

//?[a]
//083[a]
//[a]
//008C[a]
//0411[a]

//?[a]
//?0835[a]
//00[a]
//C[a]
//0411[a]
//F800[a]

unsigned int f_table[] = 
{
0x0836,//0x0835, //  0 idx_version
0x008C, //  1 idx_count
0x0411, //  2 idx_cpu
0xF800, //  3 idx_datastart NOT USED ?
BASIC_CODE_START, //  4 idx_codestart
0x0000, //  5 idx_boardtype

(unsigned int) g_var_seg  , // idx_var       6
(unsigned int) 0          , // idx_var>>16   7
(unsigned int) f_abs      , // f_abs         8
(unsigned int) f_addsbyte , // f_addsbyte    9
(unsigned int) f_addstr   , // f_addstr      10
(unsigned int) 0          , // f_bitin       11  eliminate someday, by calling f_wrdir and pb_input
(unsigned int) 0          , // f_bitout      12
(unsigned int) 0          , //               13
(unsigned int) f_dec2str  , // f_dec2str     14
(unsigned int) f_div      , // f_div         15
(unsigned int) 0          , // f_dup         16
(unsigned int) f_eq       , // f_eq          17
(unsigned int) f_ge       , // f_ge          18
(unsigned int) 0          , // f_getbaud     19
(unsigned int) 0          , // mac_high      20
(unsigned int) 0          , // mac_mid       21
(unsigned int) 0          , // mac_low       22
(unsigned int) flt_print  , // flt_print     23
(unsigned int) f_getrxd   , // f_getrxd      24
(unsigned int) flt_2int   , // flt_2int      25
(unsigned int) f_getstr   , // f_getstr      26
(unsigned int) f_gettimer , // f_gettimer    27
(unsigned int) flt_2float , // flt_2float    28
(unsigned int) flt_n2float, // flt_n2float   29
(unsigned int) f_gt       , // f_gt          30
(unsigned int) f_hex2str  , // f_hex2str     31
(unsigned int) flt_2str   , // flt_2str      32
(unsigned int) f_le       , // f_le          33
(unsigned int) f_left     , // f_left        34
(unsigned int) f_logand   , // f_logand      35
(unsigned int) f_lognot   , // f_lognot      36
(unsigned int) f_logor    , // f_logor       37
(unsigned int) f_logxor   , // f_logxor      38
(unsigned int) f_lt       , // f_lt          39
(unsigned int) varsize    , // varsize       40   data size  >>4
(unsigned int) FLASH_END  , // flashend      41   flash end  >>4
(unsigned int) f_mod      , // f_mod         42
(unsigned int) f_ne       , // f_ne          43
(unsigned int) f_newstr   , // f_newstr      44
(unsigned int) flt_printR , // flt_printR    45
(unsigned int) flt_add    , // flt_add       46
(unsigned int) flt_sub    , // flt_sub       47
(unsigned int) f_pbinbit  , // f_pbinbit     48
(unsigned int) flt_neg    , // flt_neg       49
(unsigned int) flt_div    , // flt_div       50
(unsigned int) flt_mul    , // flt_mul       51
(unsigned int) f_pboutbit , // f_pboutbit    52
(unsigned int) 0          , // f_peekw       53
(unsigned int) 0          , // f_pokew       54
(unsigned int) f_print    , // f_print       55
(unsigned int) f_printch  , // f_printch     56
(unsigned int) f_printCR  , // f_printCR     57
(unsigned int) WRFLASH_BLOCK_SIZE, // blksize       58
(unsigned int) f_printstr , // f_printstr    59
(unsigned int) f_printTAB , // f_printTAB    60
(unsigned int) f_rddirbit , // f_rddirbit    61
(unsigned int) b_sprintf  , // b_sprintf     62
(unsigned int) b_sprintfR , // b_sprintfR    63
(unsigned int) 0          , // f_read        64
(unsigned int) 0          , // f_restore     65
(unsigned int) f_rev      , // f_rev         66
(unsigned int) f_right    , // f_right       67
(unsigned int) f_savestr  , // f_savestr     68
(unsigned int) f_setbaud  , // f_setbaud     69
(unsigned int) 0          , //               70
(unsigned int) 0          , // f_setDTpt     71
(unsigned int) flt_lt     , // flt_lt        72
(unsigned int) flt_gt     , // flt_gt        73
(unsigned int) flt_le     , // flt_le        74
(unsigned int) flt_ge     , // flt_ge        75
(unsigned int) f_settimer , // f_settimer    76
(unsigned int) f_settxd   , // f_settxd      77
(unsigned int) flt_ne     , // flt_ne        78
(unsigned int) flt_n2int  , // flt_n2int     79
(unsigned int) flt_eq     , // flt_eq        80
(unsigned int) f_str2dec  , // f_str2dec     81
(unsigned int) f_strcmp   , // f_strcmp      82
(unsigned int) f_strlen   , // f_strlen      83
(unsigned int) 0          , // f_swap        84
(unsigned int) f_waitmicro, // f_waitmicro   85
(unsigned int) f_wait     , // f_wait        86
(unsigned int) f_wrdirbit , // f_wrdirbit    87
(unsigned int) 0          , // fileeof       88
(unsigned int) 0          , // n_call        89
(unsigned int) 0          , // n_callfwd     90
(unsigned int) 0          , // n_loadc       91
(unsigned int) 0          , // n_loadi       92
(unsigned int) 0          , // n_loadnc      93
(unsigned int) 0          , // n_loadni      94
(unsigned int) 0          , // n_opend       95  used by very old ARM code -- now being used for file calls
(unsigned int) 0          , // n_ret         96  used by very old ARM code -- now being used for file calls
(unsigned int) 0          , // n_storei      97
(unsigned int) 0          , // n_tjmpfwd     98
(unsigned int) 0          , // n_tjzfwd      99
0,//(unsigned int) f_adin     , // f_adin        100 added for LPC2103
(unsigned int) 0          , // f_fread       101 ARMweb diagnostics used to check SPI-ethernet for now
(unsigned int) 0          , // f_hwout       102 ARMweb diagnostics used to check SPI-ethernet for now
(unsigned int) f_bytein   , // f_bytein      103 ARMweb read a byte
(unsigned int) f_byteout  , // f_byteout     104 ARMweb write a byte
(unsigned int) 0          , // f_strchr      105 ARMweb write a byte
(unsigned int) &str_aptr  , // str_aptr      106
(unsigned int) 0          , // str_aptr>>16  107
(unsigned int) 0          , // f_sort        108 random
(unsigned int) 0          , // f_fwrite      109
(unsigned int) f_intsw    , // f_intsw       110
(unsigned int) f_stop     , // f_stop        111
(unsigned int) TBL_TODO   , // f_cgiin       112 these could move someday but will break ARMweb
(unsigned int) TBL_TODO   , // f_email       113
(unsigned int) TBL_TODO   , // f_udpin       114
(unsigned int) TBL_TODO   , // f_udpout      115
(unsigned int) 0          , // f_intTIMER    116
(unsigned int) 0          , // f_intEINT0    117
(unsigned int) 0          , // f_intEINT2    118
(unsigned int) 0          , // f_intEINT1    119
(unsigned int) TBL_TODO   , // f_lastip      120  these could move someday but will break ARMweb
(unsigned int) TBL_TODO   , // f_http        121  overlays old getrxd1
(unsigned int) f_txfree   , // f_txfree      122  overlays old settxd1
(unsigned int) 0          , // f_genINT      123  serial # goes here
(unsigned int) str_accum  , // str_accum     124
(unsigned int) 0          , // str_accum>>16 125
(unsigned int) TBL_TODO   , // f_getmyip     126
(unsigned int) // ModbusTCP stuff
(unsigned int) TBL_TODO   , // f_setmyip     127 not yet implimented
(unsigned int) TBL_TODO   , // f_enet_rcv    128
(unsigned int) TBL_TODO   , // f_enet_send   129
(unsigned int) TBL_TODO   , // f_enet_init   130  not yet implimented
(unsigned int) 0          , // fileeof       131
(unsigned int) 0          , // filechdir     132  not yet implimented
(unsigned int) 0          , // filereaddir   133
(unsigned int) 0          , // fileopen      134
(unsigned int) 0          , // filewritech   135
(unsigned int) 0          , // filereadch    136
(unsigned int) 0          , // fileclose     137
(unsigned int) 0          , // f_sort        138
(unsigned int) 0          , // reserved      139
(unsigned int) 0            // get warning <=140
};
//#endif // FOR_BASIC

void SystemInit (void)
{
	/* FPU settings ------------------------------------------------------------*/
	#if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
		SCB->CPACR |= ((3UL << 10*2)|(3UL << 11*2));  /* set CP10 and CP11 Full Access */
	#endif
	
