TodWulff/ARMbasic_Repo/_Coridium/MiClib/system_stm32f411.c
	// Configure Flash prefetch, Instruction cache, Data cache
	FLASH->ACR |= 0x00000100;//FLASH_ACR_PRFTEN
	FLASH->ACR |= 0x00000200;//FLASH_ACR_ICEN
	FLASH->ACR |= 0x00000400;//FLASH_ACR_DCEN
 
	NVIC_SetPriorityGrouping(3); // Set Interrupt Group Priority NVIC_PRIORITYGROUP_4, 4 bits for pre-emption priority
	
	#if defined EMW3165
	platform_init_system_clocks(); // EXTERNAL
	#else
	SystemClock_Config();// INTERNAL Configure the system clock to 100 MHz
	#endif
	
	GPIOA_CLK_ENABLE();  // Enable GPIOA Clock (to be able to program the configuration registers)
	GPIOB_CLK_ENABLE();
	GPIOC_CLK_ENABLE();
	GPIOD_CLK_ENABLE();
	
	sector_erased = -1;
	
#ifdef FOR_BASIC
	MEMCPY((void *)0x20000000, (void *)0x00000000, 87<<2);
	SCB->VTOR = 0x20000000; //assign new vector table in RAM, so interrupts can be patched by BASIC
#endif	

	// fix f_table
	f_table[  7] = f_table[  6]>>16; // g_var_seg
	f_table[107] = f_table[106]>>16; // str_aptr
	f_table[125] = f_table[124]>>16; // str_accum
	
	int i;
	//NOTE &0xFFFe because functions return offset+1, variables do not but this is OK
	for(i=6;i<=140;i++) {f_table[i] = f_table[i] & 0xFFFe;}
}

#if defined NUCLEO
/** NOTE this is the setup for internal 16MHz
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSI)
  *            SYSCLK(Hz)                     = 100000000
  *            HCLK(Hz)                       = 100000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 2
  *            APB2 Prescaler                 = 1
  *            HSI Frequency(Hz)              = 16000000
  *            PLL_M                          = 16
  *            PLL_N                          = 400
  *            PLL_P                          = 4
  *            PLL_Q                          = 7
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale2 mode
  *            Flash Latency(WS)              = 3
  * @param  None
  * @retval None
  */
void SystemClock_Config(void)
{
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_OscInitTypeDef RCC_OscInitStruct;

	/* Enable Power Control clock */
	PWR_CLK_ENABLE();
	
	//The voltage scaling allows optimizing the power consumption when the device is clocked below the maximum system 
	//frequency, to update the voltage scaling value regarding system frequency refer to product datasheet.
	//__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);
				                            
	/* Enable HSI Oscillator and activate PLL with HSI as source */
//#ifdef NUCLEO	
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.HSICalibrationValue = 0x10; // ?? no calibration value for HSE ??
	RCC_OscInitStruct.PLL.PLLM = 16;
	RCC_OscInitStruct.PLL.PLLN = 400;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
//#else
//	/* -1- Select HSI as system clock source to allow modification of the PLL configuration */
//	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
//	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
//	STM_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3);
//	
//	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
//	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
//	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
//	RCC_OscInitStruct.PLL.PLLM = 25;
//	RCC_OscInitStruct.PLL.PLLN = 336;
//	RCC_OscInitStruct.PLL.PLLP = 2;
//#endif
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLQ = 7;
	STM_OscConfig(&RCC_OscInitStruct);
	
	/* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers */
	RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;  
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;  
	STM_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3);
}


/**
  * @brief  Initializes the RCC Oscillators according to the specified parameters in the RCC_OscInitTypeDef.
  * @param  RCC_OscInitStruct: pointer to an RCC_OscInitTypeDef structure that
  *         contains the configuration information for the RCC Oscillators.
  * @note   The PLL is not disabled when used as system clock.
  * @retval HAL status
  */
void STM_OscConfig(RCC_OscInitTypeDef  *RCC_OscInitStruct)
{
 
	/*------------------------------- HSE Configuration ------------------------*/ 
	if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE)
	{
		/* When the HSE is used as system clock or clock source for PLL in these cases HSE will not be disabled */
		if(((RCC->CFGR & RCC_CFGR_SWS) == RCC_CFGR_SWS_HSE)                                                                     ||\
			(((RCC->CFGR & RCC_CFGR_SWS) == RCC_CFGR_SWS_PLL) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSE)))
		{
			if((__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != 0) && (RCC_OscInitStruct->HSEState == RCC_HSE_OFF))
			{
			  return ;// HAL_ERROR;
			}
		}
		else
		{
			/* Reset HSEON and HSEBYP bits before configuring the HSE --------------*/
			__HAL_RCC_HSE_CONFIG(RCC_HSE_OFF);
			
			/* Wait till HSE is disabled */  
			while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != 0){} // hang
			
			/* Set the new HSE configuration ---------------------------------------*/
			__HAL_RCC_HSE_CONFIG(RCC_OscInitStruct->HSEState);
			
			/* Check the HSE State */
			if((RCC_OscInitStruct->HSEState) != RCC_HSE_OFF)
			{
			  /* Wait till HSE is ready */  
			  while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == 0){} // hang
			}
			else
			{
			  /* Wait till HSE is bypassed or disabled */
			  while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != 0){} // hang
			}
		}
	}
	/*----------------------------- HSI Configuration --------------------------*/
	if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI)
	{
		/* Check if HSI is used as system clock or as PLL source when PLL is selected as system clock */
		if(((RCC->CFGR & RCC_CFGR_SWS) == RCC_CFGR_SWS_HSI)                                                                     ||\
			(((RCC->CFGR & RCC_CFGR_SWS) == RCC_CFGR_SWS_PLL) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSI)))
		{
			/* When HSI is used as system clock it will not disabled */
			if((__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != 0) && (RCC_OscInitStruct->HSIState != RCC_HSI_ON))
			{
			  return ;// HAL_ERROR;
			}
			/* Otherwise, just the calibration is allowed */
			else
			{
			  /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
			  __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_OscInitStruct->HSICalibrationValue);
			}
		}
		else
		{
			/* Check the HSI State */
			if((RCC_OscInitStruct->HSIState)!= RCC_HSI_OFF)
			{
			  /* Enable the Internal High Speed oscillator (HSI). */
			  __HAL_RCC_HSI_ENABLE();

			  /* Wait till HSI is ready */  
			  while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == 0){} // hang
			          
			  /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
			  __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_OscInitStruct->HSICalibrationValue);
			}
			else
			{
			  /* Disable the Internal High Speed oscillator (HSI). */
			  __HAL_RCC_HSI_DISABLE();

			  /* Wait till HSI is ready */  
			  while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != 0){} // hang
			}
		}
	}
	/*------------------------------ LSI Configuration -------------------------*/
	if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI)
	{
		/* Check the LSI State */
		if((RCC_OscInitStruct->LSIState)!= RCC_LSI_OFF)
		{
			/* Enable the Internal Low Speed oscillator (LSI). */
			__HAL_RCC_LSI_ENABLE();
			
			/* Wait till LSI is ready */
			while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) == 0){} // hang
		}
		else
		{
			/* Disable the Internal Low Speed oscillator (LSI). */
			__HAL_RCC_LSI_DISABLE();
			
			/* Wait till LSI is ready */  
			while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) != 0){} // hang
		}
	}
	/*------------------------------ LSE Configuration -------------------------*/ 
	if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSE) == RCC_OSCILLATORTYPE_LSE)
	{
		/* Enable Power Clock*/
		PWR_CLK_ENABLE();
		
