TodWulff/ARMbasic_Repo/_Coridium/MiClib/system_stm32f411.c
		/* Enable write access to Backup domain */
		PWR->CR |= PWR_CR_DBP;
		
		/* Wait for Backup domain Write protection disable */
		while((PWR->CR & PWR_CR_DBP) == 0){} // hang
		
		/* Reset LSEON and LSEBYP bits before configuring the LSE ----------------*/
		__HAL_RCC_LSE_CONFIG(RCC_LSE_OFF);
		
		/* Wait till LSE is ready */  
		while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) != 0){} // hang
		
		/* Set the new LSE configuration -----------------------------------------*/
		__HAL_RCC_LSE_CONFIG(RCC_OscInitStruct->LSEState);
		/* Check the LSE State */
		if((RCC_OscInitStruct->LSEState) != RCC_LSE_OFF)
		{
			/* Wait till LSE is ready */  
			while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) == 0){} // hang
		}
		else
		{
			/* Wait till LSE is ready */  
			while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) != 0){} // hang
		}
	}
	/*-------------------------------- PLL Configuration -----------------------*/
	if ((RCC_OscInitStruct->PLL.PLLState) != RCC_PLL_NONE)
	{
		/* Check if the PLL is used as system clock or not */
		if((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
		{ 
			if((RCC_OscInitStruct->PLL.PLLState) == RCC_PLL_ON)
			{
			  /* Disable the main PLL. */
			  __HAL_RCC_PLL_DISABLE();
			  
			  /* Wait till PLL is ready */  
			  while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) != 0){} // hang

			  /* Configure the main PLL clock source, multiplication and division factors. */
			  WRITE_REG(RCC->PLLCFGR, (RCC_OscInitStruct->PLL.PLLSource                                            | \
			                           RCC_OscInitStruct->PLL.PLLM                                                 | \
			                           (RCC_OscInitStruct->PLL.PLLN << POSITION_VAL(RCC_PLLCFGR_PLLN))             | \
			                           (((RCC_OscInitStruct->PLL.PLLP >> 1) -1) << POSITION_VAL(RCC_PLLCFGR_PLLP)) | \
			                           (RCC_OscInitStruct->PLL.PLLQ << POSITION_VAL(RCC_PLLCFGR_PLLQ))));
			  /* Enable the main PLL. */
			  __HAL_RCC_PLL_ENABLE();

			  /* Wait till PLL is ready */  
			  while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == 0){} // hang
			}
			else
			{
			  /* Disable the main PLL. */
			  __HAL_RCC_PLL_DISABLE();
 
			  /* Wait till PLL is ready */  
			  while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) != 0){} // hang
			}
		}
		else
		{
			return ;// HAL_ERROR;
		}
	}
	//return HAL_OK;
}
 
/**
	* @brief  Initializes the CPU, AHB and APB busses clocks according to the specified 
	*		     parameters in the RCC_ClkInitStruct.
	* @param  RCC_ClkInitStruct: pointer to an RCC_OscInitTypeDef structure that
	*		     contains the configuration information for the RCC peripheral.
	* @param  FLatency: FLASH Latency, this parameter depend on device selected
	* 
	* @note   The SystemCoreClock CMSIS variable is used to store System Clock Frequency 
	*		     and updated by HAL_RCC_GetHCLKFreq() function called within this function
	*
	* @note   The HSI is used (enabled by hardware) as system clock source after
	*		     startup from Reset, wake-up from STOP and STANDBY mode, or in case
	*		     of failure of the HSE used directly or indirectly as system clock
	*		     (if the Clock Security System CSS is enabled).
	*		       
	* @note   A switch from one clock source to another occurs only if the target
	*		     clock source is ready (clock stable after startup delay or PLL locked). 
	*		     If a clock source which is not yet ready is selected, the switch will
	*		     occur when the clock source will be ready. 
	*		       
	* @note   Depending on the device voltage range, the software has to set correctly
	*		     HPRE[3:0] bits to ensure that HCLK not exceed the maximum allowed frequency
	*		     (for more details refer to section above "Initialization/de-initialization functions")
	* @retval None
	*/
void STM_ClockConfig(RCC_ClkInitTypeDef  *RCC_ClkInitStruct, uint32_t FLatency)
{
	/* To correctly read data from FLASH memory, the number of wait states (LATENCY) 
		must be correctly programmed according to the frequency of the CPU clock 
		(HCLK) and the supply voltage of the device. */
	
	/* Increasing the CPU frequency */
	if(FLatency > (FLASH->ACR & FLASH_ACR_LATENCY))
	{		
		/* Program the new number of wait states to the LATENCY bits in the FLASH_ACR register */
		__HAL_FLASH_SET_LATENCY(FLatency);
		
		/* Check that the new number of wait states is taken into account to access the Flash
		memory by reading the FLASH_ACR register */
		if((FLASH->ACR & FLASH_ACR_LATENCY) != FLatency)
		{
			return ;// HAL_ERROR;
		}

		/*-------------------------- HCLK Configuration --------------------------*/
		if(((RCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_HCLK) == RCC_CLOCKTYPE_HCLK)
		{
			MODIFY_REG(RCC->CFGR, RCC_CFGR_HPRE, RCC_ClkInitStruct->AHBCLKDivider);
		}

		/*------------------------- SYSCLK Configuration ---------------------------*/ 
		if(((RCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_SYSCLK) == RCC_CLOCKTYPE_SYSCLK)
		{	  
			/* HSE is selected as System Clock Source */
			if(RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_HSE)
			{
			  /* Check the HSE ready flag */  
			  if(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == 0)
			  {
			    return ;// HAL_ERROR;
			  }
			}
			/* PLL is selected as System Clock Source */
			else if((RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_PLLCLK)   || 
			        (RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_PLLRCLK))
			{
			  /* Check the PLL ready flag */  
			  if(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == 0)
			  {
			    return ;// HAL_ERROR;
			  }
			}
			/* HSI is selected as System Clock Source */
			else
			{
			  /* Check the HSI ready flag */  
			  if(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == 0)
			  {
			    return ;// HAL_ERROR;
			  }
			}

			__HAL_RCC_SYSCLK_CONFIG(RCC_ClkInitStruct->SYSCLKSource);
			if(RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_HSE)
			{
			  while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_SYSCLKSOURCE_STATUS_HSE){} // hang
			}
			else if(RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_PLLCLK)
			{
			  while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_SYSCLKSOURCE_STATUS_PLLCLK){} // hang
			}
			else if(RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_PLLRCLK)
			{
			  while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_SYSCLKSOURCE_STATUS_PLLRCLK){} // hang
			}
			else
			{
			  while((RCC->CFGR & RCC_CFGR_SWS) != RCC_SYSCLKSOURCE_STATUS_HSI){} // hang
			}
		}	  
	}
	/* Decreasing the CPU frequency */
	else
	{
		/*-------------------------- HCLK Configuration --------------------------*/
		if(((RCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_HCLK) == RCC_CLOCKTYPE_HCLK)
		{
			MODIFY_REG(RCC->CFGR, RCC_CFGR_HPRE, RCC_ClkInitStruct->AHBCLKDivider);
		}

		/*------------------------- SYSCLK Configuration -------------------------*/
		if(((RCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_SYSCLK) == RCC_CLOCKTYPE_SYSCLK)
		{	  
			/* HSE is selected as System Clock Source */
			if(RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_HSE)
			{
			  /* Check the HSE ready flag */  
			  if(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == 0)
			  {
			    return ;// HAL_ERROR;
			  }
			}
			/* PLL is selected as System Clock Source */
			else if((RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_PLLCLK) || 
			        (RCC_ClkInitStruct->SYSCLKSource == RCC_SYSCLKSOURCE_PLLRCLK))
			{
			  /* Check the PLL ready flag */  
			  if(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == 0)
			  {
			    return ;// HAL_ERROR;
			  }
			}
			/* HSI is selected as System Clock Source */
			else
			{
			  /* Check the HSI ready flag */  
			  if(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == 0)
			  {
			    return ;// HAL_ERROR;
			  }
			}
			__HAL_RCC_SYSCLK_CONFIG(RCC_ClkInitStruct->SYSCLKSource);
			
