TodWulff/ARMbasic_Repo/_Coridium/MiClib/system_stm32f411.c
    /* Enable the PLL */
    FLASH_SetLatency( INT_FLASH_WAIT_STATE );
	FLASH_PrefetchBufferCmd( ENABLE );

    /* Use the clock configuration utility from ST to calculate these values
     * http://www.st.com/st-web-ui/static/active/en/st_prod_software_internet/resource/technical/software/utility/stsw-stm32090.zip
     */
    RCC_PLLConfig( PLL_SOURCE, PLL_M_CONSTANT, PLL_N_CONSTANT, PLL_P_CONSTANT, PPL_Q_CONSTANT ); /* NOTE: The CPU Clock Frequency is independently defined in <WICED-SDK>/WICED/platform/<platform>/<platform>.mk */
    RCC_PLLCmd( ENABLE );

    while ( RCC_GetFlagStatus( RCC_FLAG_PLLRDY ) == RESET )
    {
    }
    RCC_SYSCLKConfig( SYSTEM_CLOCK_SOURCE );

    while ( RCC_GetSYSCLKSource( ) != 0x08 )
    {
    }

    /* Configure HCLK clock as SysTick clock source. */
    SysTick_CLKSourceConfig( SYSTICK_CLOCK_SOURCE );

}
#endif // EMW3165 

/**
  * @brief  Initializes the GPIOx peripheral according to the specified parameters in the GPIO_Init.
  * @param  GPIOx: where x can be (A..K) to select the GPIO peripheral for STM32F429X device or
  *                      x can be (A..I) to select the GPIO peripheral for STM32F40XX and STM32F427X devices.
  * @param  GPIO_Init: pointer to a GPIO_InitTypeDef structure that contains
  *         the configuration information for the specified GPIO peripheral.
  * @retval None
  */
void STM_GPIO_Init(GPIO_TypeDef  *GPIOx, GPIO_InitTypeDef *GPIO_Init)
{
	uint32_t position;
	uint32_t ioposition = 0x00;
	uint32_t iocurrent = 0x00;
	uint32_t temp = 0x00;

	/* Configure the port pins */
	for(position = 0; position < GPIO_NUMBER; position++)
	{
		/* Get the IO position */
		ioposition = ((uint32_t)0x01) << position;
		/* Get the current IO position */
		iocurrent = (uint32_t)(GPIO_Init->Pin) & ioposition;

		if(iocurrent == ioposition)
		{
			/*--------------------- GPIO Mode Configuration ------------------------*/
			/* In case of Alternate function mode selection */
			if((GPIO_Init->Mode == GPIO_MODE_AF_PP) || (GPIO_Init->Mode == GPIO_MODE_AF_OD))
			{
				/* Check the Alternate function parameter */
				/* Configure Alternate function mapped with the current IO */
				temp = GPIOx->AFR[position >> 3];
				temp &= ~((uint32_t)0xF << ((uint32_t)(position & (uint32_t)0x07) * 4)) ;
				temp |= ((uint32_t)(GPIO_Init->Alternate) << (((uint32_t)position & (uint32_t)0x07) * 4));
				GPIOx->AFR[position >> 3] = temp;
			}

			/* Configure IO Direction mode (Input, Output, Alternate or Analog) */
			temp = GPIOx->MODER;
			temp &= ~(GPIO_MODER_MODER0 << (position * 2));
			temp |= ((GPIO_Init->Mode & GPIO_MODE) << (position * 2));
			GPIOx->MODER = temp;

			/* In case of Output or Alternate function mode selection */
			if((GPIO_Init->Mode == GPIO_MODE_OUTPUT_PP) || (GPIO_Init->Mode == GPIO_MODE_AF_PP) ||
				 (GPIO_Init->Mode == GPIO_MODE_OUTPUT_OD) || (GPIO_Init->Mode == GPIO_MODE_AF_OD))
			{
				/* Check the Speed parameter */
				/* Configure the IO Speed */
				temp = GPIOx->OSPEEDR; 
				temp &= ~(GPIO_OSPEEDER_OSPEEDR0 << (position * 2));
				temp |= (GPIO_Init->Speed << (position * 2));
				GPIOx->OSPEEDR = temp;

				/* Configure the IO Output Type */
				temp = GPIOx->OTYPER;
				temp &= ~(GPIO_OTYPER_OT_0 << position) ;
				temp |= (((GPIO_Init->Mode & GPIO_OUTPUT_TYPE) >> 4) << position);
				GPIOx->OTYPER = temp;
			}

			/* Activate the Pull-up or Pull down resistor for the current IO */
			temp = GPIOx->PUPDR;
			temp &= ~(GPIO_PUPDR_PUPDR0 << (position * 2));
			temp |= ((GPIO_Init->Pull) << (position * 2));
			GPIOx->PUPDR = temp;

			/*--------------------- EXTI Mode Configuration ------------------------*/
			/* Configure the External Interrupt or event for the current IO */
			if((GPIO_Init->Mode & EXTI_MODE) == EXTI_MODE)
			{
				/* Enable SYSCFG Clock */
				SYSCFG_CLK_ENABLE();

				temp = SYSCFG->EXTICR[position >> 2];
				temp &= ~(((uint32_t)0x0F) << (4 * (position & 0x03)));
				temp |= ((uint32_t)(GPIO_GET_INDEX(GPIOx)) << (4 * (position & 0x03)));
				SYSCFG->EXTICR[position >> 2] = temp;

				/* Clear EXTI line configuration */
				temp = EXTI->IMR;
				temp &= ~((uint32_t)iocurrent);
				if((GPIO_Init->Mode & GPIO_MODE_IT) == GPIO_MODE_IT)
				{
					temp |= iocurrent;
				}
				EXTI->IMR = temp;

				temp = EXTI->EMR;
				temp &= ~((uint32_t)iocurrent);
				if((GPIO_Init->Mode & GPIO_MODE_EVT) == GPIO_MODE_EVT)
				{
					temp |= iocurrent;
				}
				EXTI->EMR = temp;

				/* Clear Rising Falling edge configuration */
				temp = EXTI->RTSR;
				temp &= ~((uint32_t)iocurrent);
				if((GPIO_Init->Mode & RISING_EDGE) == RISING_EDGE)
				{
					temp |= iocurrent;
				}
				EXTI->RTSR = temp;

				temp = EXTI->FTSR;
				temp &= ~((uint32_t)iocurrent);
				if((GPIO_Init->Mode & FALLING_EDGE) == FALLING_EDGE)
				{
					temp |= iocurrent;
				}
				EXTI->FTSR = temp;
			}
		}
	}
}

#define MAX_IO 128 // 64 ?? 65 for C1

GPIO_TypeDef* Get_GPIO_Port(int pinnum){
	int i = pinnum & 0x70;
	return 
		i == 0x00 ? GPIOA :
		i == 0x20 ? GPIOB :
		i == 0x40 ? GPIOC :
		            GPIOD ; //i == 0x60
}

void alt_wrdirbit(int pinnum, int dirval) {
	GPIO_InitTypeDef  GPIO_InitStruct;
	if(pinnum > MAX_IO) return;
	// THIS SHOULD WORK BUT I GET STARNGE RESULTS
	//GPIO_TypeDef * GPIOx = (GPIO_TypeDef *) ( GPIOA + ( (pinnum & 0x70) << 5) );
	GPIO_TypeDef * GPIOx  = Get_GPIO_Port(pinnum);
	GPIO_InitStruct.Pin   = 1<<(pinnum & 0xF);// NOTE F and not 1F because pins go 0 to 15, not 31
	GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
	GPIO_InitStruct.Pull  = GPIO_PULLUP;
	GPIO_InitStruct.Alternate = 0;

	if (dirval)	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	else        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	STM_GPIO_Init(GPIOx, &GPIO_InitStruct); 
}

int alt_rddirbit(int pinnum) {
	if(pinnum > MAX_IO) return pinnum;
	GPIO_TypeDef * GPIOx = Get_GPIO_Port(pinnum);
	return 0;//(GPIOx->MODER >> (pinnum & 0xF)) & 1;
}


int alt_inbit(int pinnum) {
	if(pinnum > MAX_IO) return pinnum;
	GPIO_TypeDef * GPIOx = Get_GPIO_Port(pinnum);
	if((GPIOx->IDR >> (pinnum & 0x1F)) & 1)
		return -1;
	else
		return 0;
}

void alt_outbit(int pinnum,int pinval) {
	GPIO_TypeDef * GPIOx = Get_GPIO_Port(pinnum);
	if(pinnum > MAX_IO) return;
	if(pinval) GPIOx->BSRR = 1 << (pinnum & 0xF);
	else       GPIOx->BSRR = 1 << ((pinnum & 0xF)+16);
	//if(pinval) GPIOx->ODR |= 1 << (pinnum & 0xF);
	//else       GPIOx->ODR &= ~(1 << (pinnum & 0xF));
}


