TodWulff/ARMbasic_Repo/_Coridium/MiClib/system_stm32f411.c
#ifndef BREAK_WAIT
#define BREAK_WAIT	1000
#endif

int startUserCode(int isRUNcommand) {
	int ch;
	int RCC_CSR;
	
	// check to see if code is valid
#warning -- need to check code validity
#if 0	
	if (((*(unsigned int *) (f_table[4]<<4)) == 0xFFFFFFFF) || ((*(unsigned int *) (f_table[4]<<4)) == 0)){
		return 0;
	}
#endif
	
	if (isRUNcommand) {	
	    return 1;
    } else {					// got here on RESET/Power on/Fault/BOD/WDT
	
#warning this code needs to change, as firmware name is not here	
//  #ifdef INSERT_USERNAME
//		if (checkNameValid() != (* (int *) 0x01f4 & 0xffff)) return 0;		// check for a valid firmware copy 
//  #endif
		
	 #ifdef UART_NOBUFFER	
		return 0;				// don't restart on reset for this test mode
		
	 #else
		// if we got here and the reset indicators show false, and not RUN command then its a Fault IRQ restart, so return 0
		RCC_CSR = RCC->CSR; // save status
		RCC->CSR = 1<<24; // Bit 24 RMVF: Clear the reset flags
		
		//RCC clock control & status register (RCC_CSR)
		//Bit 31 LPWRRSTF: Low-power management reset occurs.
		//Bit 30 WWDGRSTF: window watchdog reset occurs.
		//Bit 29 IWDGRSTF: independent watchdog reset from VDD domain occurs.
		//Bit 28 SFTRSTF:  software reset occurs.
		//Bit 27 PORRSTF:  POR/PDR reset occurs.
		//Bit 26 PINRSTF:  reset from the NRST pin occurs.
		//Bit 25 BORRSTF:  POR/PDR or BOR reset occurs.
		// NOTE BORRSTF and PORRSTF both include POR/PDR

		       if (RCC_CSR & 1<<27) { // power on occurred
		} else if (RCC_CSR & 1<<26) { // reset occurred
		} else if (RCC_CSR & 1<<30) { // watchdog -- user code must have enabled it so go to the user code
		} else if (RCC_CSR & 1<<25) { // brown out-- user code must have enabled it so go to the user code
		} else {
			return 0;			// must have got here by Fault ISR
		}	
	  #endif	
	}	
#warning MIKE -- above looks OK, BRUCE Please review -- but next statement needs to go once code seems good
return 0;
		
	// now wait to see if a BREAK happens -- ctlC or ESC received on UART	
		
	delay_ms(BREAK_WAIT);
	
	while ((ch = getchar()) != -1) {
	    if ((ch == ESC) || (ch == CTRLC)) {
		    return 0;
	    }
    }

	// if we got here its good to go	
	return 1;	
}	







#define ADC_CLOCKPRESCALER_PCLK_DIV4    ADC_CLOCK_SYNC_PCLK_DIV4
#define ADC_RESOLUTION12b               ADC_RESOLUTION_12B
#define EOC_SINGLE_CONV                 ADC_EOC_SINGLE_CONV
#define HAL_MAX_DELAY      0xFFFFFFFF
#define HAL_IS_BIT_SET(REG, BIT)         (((REG) & (BIT)) != RESET)
#define HAL_IS_BIT_CLR(REG, BIT)         (((REG) & (BIT)) == RESET)


unsigned char AD_Pins[] = {
0  , // 0 PA0
1  , // 1 PA1
2  , // 2 PA2
3  , // 3 PA3
4  , // 4 PA4
5  , // 5 PA5
6  , // 6 PA6
7  , // 7 PA7
32 , // 8 PB0
33 , // 9 PB1
64 , // 10 PC0
65 , // 11 PC1
66 , // 12 PC2
67 , // 13 PC3
68 , // 14 PC4
69 , // 15 PC5
};

void IO2AD(int chan)
{
	if(chan>15) return;
	GPIO_InitTypeDef  GPIO_InitStruct;
	GPIO_InitStruct.Mode = GPIO_MODE_ANALOG; // Configure the selected ADC Channel as analog input
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Pin = 1<<(AD_Pins[chan] & 31);
	GPIO_TypeDef* GPIOx = Get_GPIO_Port(AD_Pins[chan]);
	STM_GPIO_Init(GPIOx, &GPIO_InitStruct);
}


void initAD(void)//ADC_HandleTypeDef* hadc)
{
	RCC_ADC1_CLK_ENABLE();

	// Set the ADC clock prescaler
	//ADC->CCR &= ~(ADC_CCR_ADCPRE);
	//ADC->CCR |=	hadc->Init.ClockPrescaler;
	ADC->CCR = 0x00010000 ; // ClockPrescaler ADC_CLOCKPRESCALER_PCLK_DIV4 must not exceed 36MHz

	// Set ADC scan mode TODO MAYBE multiple channels
	ADC1->CR1 &= ~(ADC_CR1_SCAN); // 0 Single mode (one channel)
	//ADC1->CR1 |=	ADC_CR1_SCANCONV(hadc->Init.ScanConvMode);
	
	// Set ADC resolution
	ADC1->CR1 &= ~(ADC_CR1_RES); // 0 ADC_RESOLUTION12b
	//ADC1->CR1 |=	hadc->Init.Resolution;
	
	// Set ADC data alignment
	ADC1->CR2 &= ~(ADC_CR2_ALIGN); // 0 ALIGN_RIGHT
	//ADC1->CR2 |= hadc->Init.DataAlign;

	// Reset the external trigger
	ADC1->CR2 &= ~(ADC_CR2_EXTSEL);
	ADC1->CR2 &= ~(ADC_CR2_EXTEN);
	 
	// Enable or disable ADC continuous conversion mode
	ADC1->CR2 &= ~(ADC_CR2_CONT); // 0 DISABLE
	//ADC1->CR2 |= ADC_CR2_CONTINUOUS(hadc->Init.ContinuousConvMode);

// TODO MAYBE: multiple channels 	
//	if(hadc->Init.DiscontinuousConvMode != DISABLE)//DiscontinuousConvMode = 0; // DISABLE;
//	{
//		// Enable the selected ADC regular discontinuous mode
//		ADC1->CR1 |= (uint32_t)ADC_CR1_DISCEN;
//		
//		// Set the number of channels to be converted in discontinuous mode
//		ADC1->CR1 &= ~(ADC_CR1_DISCNUM);
//		// TODO ADC1->CR1 |=	ADC_CR1_DISCONTINUOUS(hadc->Init.NbrOfDiscConversion);
//	}
//	else
		ADC1->CR1 &= ~(ADC_CR1_DISCEN); // Disable discontinuous mode
	
	// Set ADC number of conversion
	ADC1->SQR1 &= ~(ADC_SQR1_L);
	ADC1->SQR1 |=	1<<20; //ADC_SQR1(hadc->Init.NbrOfConversion); // reset = 0, this would be += 1 for multiple channels MAR

	// Enable or disable ADC DMA continuous request
	ADC1->CR2 &= ~(ADC_CR2_DDS); // 0 DISABLE
	//ADC1->CR2 |= ADC_CR2_DMAContReq(hadc->Init.DMAContinuousRequests);
	
	// Enable or disable ADC end of conversion selection
	ADC1->CR2 &= ~(ADC_CR2_EOCS);
	ADC1->CR2 |= 1<<10;//ADC_CR2_EOCSelection(hadc->Init.EOCSelection);
}

int AD(int channel)
{
	//int adc_value = -1;
	
	if((ADC1->CR2 & ADC_CR2_ADON) != ADC_CR2_ADON)
	{	
		ADC1->CR2 |= ADC_CR2_ADON; // ADC_ENABLE
		// Delay for ADC stabilization time, actual time was 12.375 us
		delay_us(15);
	}
	
	ADC1->SQR3 = channel; // always 1 conversion, sequence 0
	ADC1->CR2 |= (uint32_t)ADC_CR2_SWSTART; // start it up
	
	// Check End of conversion flag
	// assume success, takes about 0.875 us
	while((ADC1->SR & ADC_FLAG_EOC) != ADC_FLAG_EOC){
		// if timeout return -1 or continue to return -1 below
	}
	//if((ADC1->SR & ADC_FLAG_EOC) == ADC_FLAG_EOC)
	//	adc_value = ADC1->DR;
	return ADC1->DR; // adc_value;
}


// I left this for possible future need. MAR
//@brief	Configures for the selected ADC regular channel its corresponding
//				rank in the sequencer and its sample time.
//@param	hadc: pointer to a ADC_HandleTypeDef structure that contains
//				the configuration information for the specified ADC.
//@param	sConfig: ADC configuration structure. 
//void ADC_ConfigChannel(ADC_ChannelConfTypeDef* sConfig)
//{
//	uint32_t counter = 0;
	// SMPR all default 0, sample times are 3 cycles
	//if (sConfig->Channel > 9)
	//{
	//	// Clear the old sample time
	//	ADC1->SMPR1 &= ~ADC_SMPR1(ADC_SMPR1_SMP10, sConfig->Channel);
	//	
	//	// Set the new sample time
	//	ADC1->SMPR1 |= ADC_SMPR1(sConfig->SamplingTime, sConfig->Channel);
	//}
	//else // ADC_Channel include in ADC_Channel_[0..9]
	//{
	//	// Clear the old sample time
	//	ADC1->SMPR2 &= ~ADC_SMPR2(ADC_SMPR2_SMP0, sConfig->Channel);
	//	
	//	// Set the new sample time
	//	ADC1->SMPR2 |= ADC_SMPR2(sConfig->SamplingTime, sConfig->Channel);
	//}
	
	// There is only one conversion per, rank is set in AD()
	// SQR1 L[3:0] = 0, 1 conversion
	// // For Rank 1 to 6
	// if (sConfig->Rank < 7)
	// {
	// 	// Clear the old SQx bits for the selected rank
	// 	ADC1->SQR3 &= ~ADC_SQR3_RK(ADC_SQR3_SQ1, sConfig->Rank);
	// 	
	// 	// Set the SQx bits for the selected rank
	// 	ADC1->SQR3 |= ADC_SQR3_RK(sConfig->Channel, sConfig->Rank);
	// }
	// // For Rank 7 to 12
	// else if (sConfig->Rank < 13)
	// {
	// 	// Clear the old SQx bits for the selected rank
	// 	ADC1->SQR2 &= ~ADC_SQR2_RK(ADC_SQR2_SQ7, sConfig->Rank);
	// 	
	// 	// Set the SQx bits for the selected rank
	// 	ADC1->SQR2 |= ADC_SQR2_RK(sConfig->Channel, sConfig->Rank);
	// }
	// // For Rank 13 to 16
	// else
	// {
	// 	// Clear the old SQx bits for the selected rank
	// 	ADC1->SQR1 &= ~ADC_SQR1_RK(ADC_SQR1_SQ13, sConfig->Rank);
	// 	
	// 	// Set the SQx bits for the selected rank
	// 	ADC1->SQR1 |= ADC_SQR1_RK(sConfig->Channel, sConfig->Rank);
	// }
	
	//na ?? // if ADC1 Channel_18 is selected enable VBAT Channel
	// if (sConfig->Channel == 18) // 18 is VBAT
	// {
	// 	// Enable the VBAT channel*/
	// 	ADC->CCR |= ADC_CCR_VBATE;
	// }
	
	//na ?? // if ADC1 Channel_16 or Channel_17 is selected enable TSVREFE Channel(Temperature sensor and VREFINT)
	// if ((sConfig->Channel == 16) || (sConfig->Channel == 17)) // 17 is VREFINT
	// {
	// 	// Enable the TSVREFE channel
	// 	ADC->CCR |= ADC_CCR_TSVREFE;
	// 	if(sConfig->Channel == 16) // TEMPSENSOR
	// 	{
	// 		// Delay for temperature sensor stabilization time. Compute number of CPU cycles to wait for
	// 		counter = (10*(SystemCoreClock / 1000000)); // 10 is ADC_TEMPSENSOR_DELAY_US
	// 		while(counter != 0){counter--;}
	// 	}
	// }
//}


void FLASH_Unlock(void)
{
  if((FLASH->CR & FLASH_CR_LOCK) != 0)
  {
    /* Authorize the FLASH Registers access */
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;
  }  
}

/**
  * @brief  Locks the FLASH control register access
  * @param  None
  * @retval None
  */
void FLASH_Lock(void)
{
  /* Set the LOCK Bit to lock the FLASH Registers access */
  FLASH->CR |= FLASH_CR_LOCK;
}

/**
  * @brief  Returns the FLASH Status.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PROGRAM,
  *                       FLASH_ERROR_WRP, FLASH_ERROR_OPERATION or FLASH_COMPLETE.
  */
FLASH_Status FLASH_GetStatus(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;
  
  if((FLASH->SR & FLASH_FLAG_BSY) == FLASH_FLAG_BSY) 
  {
    flashstatus = FLASH_BUSY;
  }
  else 
  {  
    if((FLASH->SR & FLASH_FLAG_WRPERR) != (uint32_t)0x00)
    { 
      flashstatus = FLASH_ERROR_WRP;
    }
    else 
    {
      if((FLASH->SR & (uint32_t)0xEF) != (uint32_t)0x00)
      {
        flashstatus = FLASH_ERROR_PROGRAM; 
      }
      else
      {
        if((FLASH->SR & FLASH_FLAG_OPERR) != (uint32_t)0x00)
        {
          flashstatus = FLASH_ERROR_OPERATION;
        }
        else
        {
          flashstatus = FLASH_COMPLETE;
        }
      }
    }
  }
  /* Return the FLASH Status */
  return flashstatus;
}

/**
  * @brief  Waits for a FLASH operation to complete.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PROGRAM,
  *                       FLASH_ERROR_WRP, FLASH_ERROR_OPERATION or FLASH_COMPLETE.
  */
FLASH_Status FLASH_WaitForLastOperation(void)
{ 
  __IO FLASH_Status status = FLASH_COMPLETE;
   
  /* Check for the FLASH Status */
  status = FLASH_GetStatus();

