TodWulff/ARMbasic_Repo/_Coridium/MiClib/system_stm32f411.c
  /* Wait for the FLASH operation to complete by polling on BUSY flag to be reset.
     Even if the FLASH operation fails, the BUSY flag will be reset and an error
     flag will be set */
  while(status == FLASH_BUSY)
  {
    status = FLASH_GetStatus();
  }
  /* Return the operation status */
  return status;
}

#define SECTOR_MASK               ((uint32_t)0xFFFFFF07)

FLASH_Status FLASH_EraseSector(uint32_t FLASH_Sector, uint8_t VoltageRange)
{
  uint32_t tmp_psize = 0x0;
  FLASH_Status status = FLASH_COMPLETE;

  /* Check the parameters */
  //assert_param(IS_FLASH_SECTOR(FLASH_Sector));
  //assert_param(IS_VOLTAGERANGE(VoltageRange));
  
  //if(VoltageRange == VoltageRange_1)
  //{
  //   tmp_psize = FLASH_PSIZE_BYTE;
  //}
  //else if(VoltageRange == VoltageRange_2)
  //{
  //  tmp_psize = FLASH_PSIZE_HALF_WORD;
  //}
  //else if(VoltageRange == VoltageRange_3)
  //{
  tmp_psize = FLASH_PSIZE_WORD; // 0x200
  //}
  //else
  //{
  //  tmp_psize = FLASH_PSIZE_DOUBLE_WORD;
  //}
  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation();
  
  if(status == FLASH_COMPLETE)
  { 
    /* if the previous operation is completed, proceed to erase the sector */
    FLASH->CR &= CR_PSIZE_MASK;
    FLASH->CR |= tmp_psize;
    FLASH->CR &= SECTOR_MASK;
    FLASH->CR |= FLASH_CR_SER | FLASH_Sector;
    FLASH->CR |= FLASH_CR_STRT;
    
    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation();
    
    /* if the erase operation is completed, disable the SER Bit */
    FLASH->CR &= (~FLASH_CR_SER);
    FLASH->CR &= SECTOR_MASK; 
  }
  /* Return the Erase Status */
  return status;
}

/**
  * @brief  Programs a word (32-bit) at a specified address.
  * @param  Address: specifies the address to be programmed.
  *         This parameter can be any address in Program memory zone or in OTP zone.  
  * @note   This function must be used when the device voltage range is from 2.7V to 3.6V. 
  * @param  Data: specifies the data to be programmed.
  * @retval FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PROGRAM,
  *                       FLASH_ERROR_WRP, FLASH_ERROR_OPERATION or FLASH_COMPLETE.
  */
int FLASH_ProgramWord(uint32_t Address, uint32_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;

  /* Check the parameters */
  //assert_param(IS_FLASH_ADDRESS(Address));

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation();
  
  if(status == FLASH_COMPLETE)
  {
    /* if the previous operation is completed, proceed to program the new data */
    FLASH->CR &= CR_PSIZE_MASK;
    FLASH->CR |= FLASH_PSIZE_WORD;
    FLASH->CR |= FLASH_CR_PG;
  
    *(__IO uint32_t*)Address = Data;
        
    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation();

    /* if the program operation is completed, disable the PG Bit */
    FLASH->CR &= (~FLASH_CR_PG);
  } 
  /* Return the Program Status */
  return (int)status;
}

//int platform_erase_flash( uint16_t start_sector, uint16_t end_sector )
int platform_erase_flash( uint16_t start_sector )
{
    /* Unlock the STM32 Flash */
    FLASH_Unlock( );

    /* Clear any error flags */
    //FLASH_ClearFlag( FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR );
	FLASH->SR = FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR ;
    //platform_watchdog_kick( );

//    for ( i = start_sector; i <= end_sector; i += 8 ){
         // FLASH_Sector_3 is (3<<3), FLASH_Sector_4 is(4<<3), etc
		if ( FLASH_EraseSector( (start_sector<<3), ERASE_VOLTAGE_RANGE ) != FLASH_COMPLETE )
        {
            /* Error occurred during erase. */
            /* TODO: Handle error */
            printf("Error during EraseFlash" );
			return 1;
        }
//    }

    FLASH_Lock( );
//printf("\nErased sector %d\n",start_sector);

    return 0;
}

int platform_write_flash_chunk( uint32_t address, const void* data, uint32_t size )
{
    int result = 0;//PLATFORM_SUCCESS;
    uint32_t write_address   = address;
    flash_write_t* data_ptr  = (flash_write_t*) data;
    flash_write_t* end_ptr   = (flash_write_t*) &((char*)data)[size];

    FLASH_Unlock( );

    /* Clear any error flags */
	FLASH->SR = FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR ;

    /* Write data to STM32 flash memory */
    while ( data_ptr < end_ptr )
    {
        FLASH_Status status;

        int tries = 0;
        /* enough data available to write as the largest size allowed by supply voltage */
        while ( ( FLASH_COMPLETE != ( status = FLASH_WRITE_FUNC( write_address, *data_ptr ) ) ) && ( tries < 10 ) )
        {
            tries++;
        }
        if ( FLASH_COMPLETE != status )
        {
            /* TODO: Handle error properly */
            printf("Error during WriteFlash" );
			result = 1;
			data_ptr = end_ptr; // might as well bail now
        }
        write_address += FLASH_WRITE_SIZE;
        data_ptr++;
    }
    if ( memcmp( (void*)address, (void*)data, size) != 0 )
    {
        result = 1;
    }
    FLASH_Lock();
//printf("\nWrote addr %08X\n",address);

    return result;
}

//Sector 0 0x0800 0000 - 0x0800 3FFF 16 Kbytes BASIC uses 12K
//Sector 1 0x0800 4000 - 0x0800 7FFF 16 Kbytes
//Sector 2 0x0800 8000 - 0x0800 BFFF 16 Kbytes
//Sector 3 0x0800 C000 - 0x0800 FFFF 16 Kbytes
//Sector 4 0x0801 0000 - 0x0801 FFFF 64 Kbytes
//Sector 5 0x0802 0000 - 0x0803 FFFF 128 Kbytes
//Sector 6 0x0804 0000 - 0x0805 FFFF 128 Kbytes
//Sector 7 0x0806 0000 - 0x0807 FFFF 128 Kbytes
#define COMPUTE_FLASH_SECTOR(flash_addr) (flash_addr<0x10000?(flash_addr>>14):(flash_addr<0x20000?4:((flash_addr&0x60000)>>17)+4))

int WriteFlash (unsigned int flash_addr, unsigned int data_addr, unsigned int blksize)
{
	char sector, result=0;

//// NOTE: I see nothing about disabling interrupts for ST

//	unsigned int NVIC_Save;
//	unsigned int Systic_Save;
//	NVIC_Save = NVIC->ISER[0]; //save current interrupt sources
//	NVIC->ICER[0] = 0xFFFFFFFF;//clear interrupt sources
//	Systic_Save = SysTick->CTRL;
//	SysTick->CTRL  = 0;        //disable SysTick

	flash_addr &= 0x7FFFF;
	sector = COMPUTE_FLASH_SECTOR(flash_addr);

	if( flash_addr & 1);									// user says do nothing
	else if((sector != sector_erased) || (flash_addr & 2)){	// bit 1 forces erase
		result = platform_erase_flash (sector);
//printf("%x 1result\n",result); 
	}
	sector_erased = sector;

//printf("%x flash addr\n",flash_addr); 
	if (result == 0) {
		result = platform_write_flash_chunk ( (flash_addr&(~3)),  data_addr, blksize);
	}
	
////printf("%x result\n",result); 
//	SysTick->CTRL = Systic_Save; 		//re-enable SysTick if it was in use CLKSOURCE=CPU clock | TICKINT | ENABLE
//	NVIC->ISER[0] = NVIC_Save;  //restore interrupt sources

	return result;
}

